Task 1

In [77]:

%pip install pandas
%pip install openpyxl
import pandas as pd

Requirement already satisfied: pandas in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sahil\appdata\roaming\python\python38\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: numpy>=1.20.3 in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.24.4)
Requirement already satisfied: tzdata>=2022.1 in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\sahil\appdata\roaming\python\python38\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.1.1; however, version 24.2 is available.
You should consider upgrading via the 'c:\Users\sahil\AppData\Local\Programs\Python\Python38\python.exe -m pip install --upgrade pip' command.

Note: you may need to restart the kernel to use updated packages.Requirement already satisfied: openpyxl in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (from openpyxl) (1.1.0)

WARNING: You are using pip version 21.1.1; however, version 24.2 is available.
You should consider upgrading via the 'c:\Users\sahil\AppData\Local\Programs\Python\Python38\python.exe -m pip install --upgrade pip' command.

In [78]:
df_cric = pd.read_excel("Cricket.xlsx")
df_hoc = pd.read_excel("Hockey.xlsx")
df_voll = pd.read_csv("Volleyball.csv")
master_df = pd.read_excel("Master_data_excel (1).xlsx")

In [79]:
hoc_head = df_hoc.head(10)

In [80]:
hoc_head

     ID                NAME LOCATION        DEPT  AGE
0  A002   BHAVESH BALDANIYA    Delhi  technology   35
1  A003        YASH BAVISHI    Delhi  production   22
2  A004      SHREEKARA BHAT   Indore       sales   34
3  A005         KUNAL BHATT   Mumbai  technology   31
4  A013         ANIKET GAMI   Indore  production   42
5  A014  RAHUL GIMHAVANEKAR    Delhi  production   27
6  A016      YOSUFF HUSSAIN     Pune       sales   29
7  A018         ISHWAR IYER    Delhi  production   29
8  A019       ATHARVA KADAM   Indore   marketing   28
9  A021         KARAN KAMAT     Pune  technology   44

In [81]:
master_head = master_df.head(10)

In [82]:
master_head

     ID                NAME LOCATION        DEPT  AGE
0  A001   HARTEJ SINGH ASSI   Mumbai       sales   23
1  A002   BHAVESH BALDANIYA    Delhi  technology   35
2  A003        YASH BAVISHI    Delhi  production   22
3  A004      SHREEKARA BHAT   Indore       sales   34
4  A005         KUNAL BHATT   Mumbai  technology   31
5  A006      DARRYL CARDOZA   Mumbai  production   26
6  A007    SURESH CHAUDHARY    Delhi       sales   28
7  A009    CHIRAG CHOUDHARY     Pune       sales   40
8  A010      YASH CHOWDHARI    Delhi  technology   45
9  A011  MIHIR DHANGDHARIYA   Mumbai  technology   33

In [83]:
marter_dict = master_df.to_dict("index")

In [84]:
marter_dict

{0: {'ID': 'A001',
  'NAME': 'HARTEJ SINGH ASSI',
  'LOCATION': 'Mumbai',
  'DEPT': 'sales',
  'AGE': 23},
 1: {'ID': 'A002',
  'NAME': 'BHAVESH BALDANIYA',
  'LOCATION': 'Delhi',
  'DEPT': 'technology',
  'AGE': 35},
 2: {'ID': 'A003',
  'NAME': 'YASH BAVISHI',
  'LOCATION': 'Delhi',
  'DEPT': 'production',
  'AGE': 22},
 3: {'ID': 'A004',
  'NAME': 'SHREEKARA BHAT',
  'LOCATION': 'Indore',
  'DEPT': 'sales',
  'AGE': 34},
 4: {'ID': 'A005',
  'NAME': 'KUNAL BHATT',
  'LOCATION': 'Mumbai',
  'DEPT': 'technology',
  'AGE': 31},
 5: {'ID': 'A006',
  'NAME': 'DARRYL CARDOZA',
  'LOCATION': 'Mumbai',
  'DEPT': 'production',
  'AGE': 26},
 6: {'ID': 'A007',
  'NAME': 'SURESH CHAUDHARY',
  'LOCATION': 'Delhi',
  'DEPT': 'sales',
  'AGE': 28},
 7: {'ID': 'A009',
  'NAME': 'CHIRAG CHOUDHARY',
  'LOCATION': 'Pune',
  'DEPT': 'sales',
  'AGE': 40},
 8: {'ID': 'A010',
  'NAME': 'YASH CHOWDHARI',
  'LOCATION': 'Delhi',
  'DEPT': 'technology',
  'AGE': 45},
 9: {'ID': 'A011',
  'NAME': 'MIHIR DHANGDHARIYA',
  'LOCATION': 'Mumbai',
  'DEPT': 'technology',
  'AGE': 33},
 10: {'ID': 'A012',
  'NAME': 'SANKET GADGE',
  'LOCATION': 'Pune',
  'DEPT': 'marketing',
  'AGE': 33},
 11: {'ID': 'A013',
  'NAME': 'ANIKET GAMI',
  'LOCATION': 'Indore',
  'DEPT': 'production',
  'AGE': 42},
 12: {'ID': 'A014',
  'NAME': 'RAHUL GIMHAVANEKAR',
  'LOCATION': 'Delhi',
  'DEPT': 'production',
  'AGE': 27},
 13: {'ID': 'A015',
  'NAME': 'ANAMICA GUPTA',
  'LOCATION': 'Mumbai',
  'DEPT': 'sales',
  'AGE': 27},
 14: {'ID': 'A016',
  'NAME': 'YOSUFF HUSSAIN',
  'LOCATION': 'Pune',
  'DEPT': 'sales',
  'AGE': 29},
 15: {'ID': 'A017',
  'NAME': 'AGHA AYAAN HYDER',
  'LOCATION': 'Pune',
  'DEPT': 'production',
  'AGE': 22},
 16: {'ID': 'A018',
  'NAME': 'ISHWAR IYER',
  'LOCATION': 'Delhi',
  'DEPT': 'production',
  'AGE': 29},
 17: {'ID': 'A019',
  'NAME': 'ATHARVA KADAM',
  'LOCATION': 'Indore',
  'DEPT': 'marketing',
  'AGE': 28},
 18: {'ID': 'A020',
  'NAME': 'RIYA KADAM',
  'LOCATION': 'Mumbai',
  'DEPT': 'marketing',
  'AGE': 34},
 19: {'ID': 'A021',
  'NAME': 'KARAN KAMAT',
  'LOCATION': 'Pune',
  'DEPT': 'technology',
  'AGE': 44},
 20: {'ID': 'A022',
  'NAME': 'RAHAT JAHA KHAN',
  'LOCATION': 'Mumbai',
  'DEPT': 'sales',
  'AGE': 47},
 21: {'ID': 'A024',
  'NAME': 'HARIKRISHNAN KONGIPARAMBIL',
  'LOCATION': 'Nagpur',
  'DEPT': 'sales',
  'AGE': 41},
 22: {'ID': 'A025',
  'NAME': 'HARSH KOTHARE',
  'LOCATION': 'Mumbai',
  'DEPT': 'production',
  'AGE': 36},
 23: {'ID': 'A026',
  'NAME': 'NIDHI MADNANI',
  'LOCATION': 'Hydrabad',
  'DEPT': 'technology',
  'AGE': 38},
 24: {'ID': 'A027',
  'NAME': 'NETRA MAHADIK',
  'LOCATION': 'Mumbai',
  'DEPT': 'technology',
  'AGE': 38},
 25: {'ID': 'A028',
  'NAME': 'KUNAL MAHAJAN',
  'LOCATION': 'Indore',
  'DEPT': 'sales',
  'AGE': 38},
 26: {'ID': 'A030',
  'NAME': 'AZRIEL MENDES',
  'LOCATION': 'Pune',
  'DEPT': 'production',
  'AGE': 48},
 27: {'ID': 'A031',
  'NAME': 'ADITYA MENON',
  'LOCATION': 'Hydrabad',
  'DEPT': 'production',
  'AGE': 43},
 28: {'ID': 'A032',
  'NAME': 'ISHANT MISHRA',
  'LOCATION': 'Indore',
  'DEPT': 'marketing',
  'AGE': 24},
 29: {'ID': 'A033',
  'NAME': 'PARAG MORE',
  'LOCATION': 'Mumbai',
  'DEPT': 'production',
  'AGE': 24},
 30: {'ID': 'A034',
  'NAME': 'ARCHIT MUNI',
  'LOCATION': 'Hydrabad',
  'DEPT': 'technology',
  'AGE': 26},
 31: {'ID': 'A035',
  'NAME': 'MOHAMMAD NEDARIYA',
  'LOCATION': 'Mumbai',
  'DEPT': 'marketing',
  'AGE': 29},
 32: {'ID': 'A036',
  'NAME': 'SUYASH NIGAM',
  'LOCATION': 'Indore',
  'DEPT': 'marketing',
  'AGE': 29},
 33: {'ID': 'A037',
  'NAME': 'AMEY NIMBALKAR',
  'LOCATION': 'Pune',
  'DEPT': 'marketing',
  'AGE': 35},
 34: {'ID': 'A038',
  'NAME': 'DHRUMIL OZA',
  'LOCATION': 'Delhi',
  'DEPT': 'technology',
  'AGE': 36},
 35: {'ID': 'A039',
  'NAME': 'HEMISH PADHIYAR',
  'LOCATION': 'Delhi',
  'DEPT': 'sales',
  'AGE': 38},
 36: {'ID': 'A040',
  'NAME': 'KRISHNA PALAN',
  'LOCATION': 'Hydrabad',
  'DEPT': 'sales',
  'AGE': 38},
 37: {'ID': 'A042',
  'NAME': 'PARTH SURVE',
  'LOCATION': 'Delhi',
  'DEPT': 'technology',
  'AGE': 40},
 38: {'ID': 'A043',
  'NAME': 'YASHUVARDHAN PATEL',
  'LOCATION': 'Pune',
  'DEPT': 'sales',
  'AGE': 40},
 39: {'ID': 'A044',
  'NAME': 'PRASHANT POOJARY',
  'LOCATION': 'Mumbai',
  'DEPT': 'production',
  'AGE': 35},
 40: {'ID': 'A045',
  'NAME': 'MUDIT POTDAR',
  'LOCATION': 'Nagpur',
  'DEPT': 'technology',
  'AGE': 37},
 41: {'ID': 'A046',
  'NAME': 'PRASAD SANGALE',
  'LOCATION': 'Indore',
  'DEPT': 'sales',
  'AGE': 32},
 42: {'ID': 'A047',
  'NAME': 'PAYAL SANKHLA',
  'LOCATION': 'Delhi',
  'DEPT': 'marketing',
  'AGE': 31},
 43: {'ID': 'A048',
  'NAME': 'MIHIR SAWANT',
  'LOCATION': 'Nagpur',
  'DEPT': 'marketing',
  'AGE': 30},
 44: {'ID': 'A049',
  'NAME': 'JAINIL SHAH',
  'LOCATION': 'Delhi',
  'DEPT': 'technology',
  'AGE': 30},
 45: {'ID': 'A050',
  'NAME': 'NEHA SHAH',
  'LOCATION': 'Nagpur',
  'DEPT': 'production',
  'AGE': 29},
 46: {'ID': 'A052',
  'NAME': 'AFRAZ SHAIKH',
  'LOCATION': 'Indore',
  'DEPT': 'sales',
  'AGE': 27},
 47: {'ID': 'A053',
  'NAME': 'HUSSAIN SHAIKH',
  'LOCATION': 'Nagpur',
  'DEPT': 'sales',
  'AGE': 23},
 48: {'ID': 'A054',
  'NAME': 'ABHISHEK SHARMA',
  'LOCATION': 'Delhi',
  'DEPT': 'marketing',
  'AGE': 29},
 49: {'ID': 'A055',
  'NAME': 'CHAYAN SHARMA',
  'LOCATION': 'Pune',
  'DEPT': 'technology',
  'AGE': 36},
 50: {'ID': 'A056',
  'NAME': 'DIVYANG SHETH',
  'LOCATION': 'Mumbai',
  'DEPT': 'marketing',
  'AGE': 36},
 51: {'ID': 'A057',
  'NAME': 'MADHURAM SHUKLA',
  'LOCATION': 'Nagpur',
  'DEPT': 'marketing',
  'AGE': 37},
 52: {'ID': 'A058',
  'NAME': 'ANMOL SINHA',
  'LOCATION': 'Delhi',
  'DEPT': 'production',
  'AGE': 49},
 53: {'ID': 'A059',
  'NAME': 'TUSHAR SINHA',
  'LOCATION': 'Indore',
  'DEPT': 'technology',
  'AGE': 33},
 54: {'ID': 'A061',
  'NAME': 'KRITI THAKRAR',
  'LOCATION': 'Mumbai',
  'DEPT': 'production',
  'AGE': 24},
 55: {'ID': 'A062',
  'NAME': 'HARSHIT THAPAR',
  'LOCATION': 'Nagpur',
  'DEPT': 'marketing',
  'AGE': 35},
 56: {'ID': 'A063',
  'NAME': 'ABHAY TIWARI',
  'LOCATION': 'Mumbai',
  'DEPT': 'sales',
  'AGE': 33},
 57: {'ID': 'A064',
  'NAME': 'TULSI VAIDYA',
  'LOCATION': 'Pune',
  'DEPT': 'marketing',
  'AGE': 33},
 58: {'ID': 'A065',
  'NAME': 'SHUBHAM WANI',
  'LOCATION': 'Indore',
  'DEPT': 'technology',
  'AGE': 38},
 59: {'ID': 'A066',
  'NAME': 'SHAYAN ZAIDI',
  'LOCATION': 'Mumbai',
  'DEPT': 'technology',
  'AGE': 37},
 60: {'ID': 'A067',
  'NAME': 'NIDHI AGRAWAL',
  'LOCATION': 'Mumbai',
  'DEPT': 'marketing',
  'AGE': 49},
 61: {'ID': 'L002',
  'NAME': 'OM AGRAWAL',
  'LOCATION': 'Nagpur',
  'DEPT': 'production',
  'AGE': 30},
 62: {'ID': 'L003',
  'NAME': 'VANSHAJ AJMERA',
  'LOCATION': 'Nagpur',
  'DEPT': 'marketing',
  'AGE': 30},
 63: {'ID': 'L005',
  'NAME': 'RAHUL BHATT',
  'LOCATION': 'Mumbai',
  'DEPT': 'marketing',
  'AGE': 29},
 64: {'ID': 'L007',
  'NAME': 'DHRUV CHAUHAN',
  'LOCATION': 'Mumbai',
  'DEPT': 'sales',
  'AGE': 27},
 65: {'ID': 'L008',
  'NAME': 'ISHA GHATULE',
  'LOCATION': 'Pune',
  'DEPT': 'sales',
  'AGE': 23},
 66: {'ID': 'L011',
  'NAME': 'ADITYA JAIN',
  'LOCATION': 'Pune',
  'DEPT': 'production',
  'AGE': 29},
 67: {'ID': 'L013',
  'NAME': 'VEDIKA KHANDELWAL',
  'LOCATION': 'Mumbai',
  'DEPT': 'technology',
  'AGE': 36},
 68: {'ID': 'L014',
  'NAME': 'ADITYA LAD',
  'LOCATION': 'Nagpur',
  'DEPT': 'marketing',
  'AGE': 36},
 69: {'ID': 'L016',
  'NAME': 'ANAY MAHESHWARI',
  'LOCATION': 'Indore',
  'DEPT': 'sales',
  'AGE': 37},
 70: {'ID': 'L017',
  'NAME': 'SANJANA MEHTA',
  'LOCATION': 'Indore',
  'DEPT': 'technology',
  'AGE': 49},
 71: {'ID': 'L019',
  'NAME': 'RHEA NAIR',
  'LOCATION': 'Pune',
  'DEPT': 'technology',
  'AGE': 33},
 72: {'ID': 'L020',
  'NAME': 'KAVIT NAVADIA',
  'LOCATION': 'Mumbai',
  'DEPT': 'marketing',
  'AGE': 24},
 73: {'ID': 'L021',
  'NAME': 'ABHAY PAI',
  'LOCATION': 'Indore',
  'DEPT': 'marketing',
  'AGE': 35},
 74: {'ID': 'L022',
  'NAME': 'SHUBH PATEL',
  'LOCATION': 'Pune',
  'DEPT': 'sales',
  'AGE': 33},
 75: {'ID': 'L023',
  'NAME': 'CHAITANYA PATEL',
  'LOCATION': 'Mumbai',
  'DEPT': 'production',
  'AGE': 33},
 76: {'ID': 'L024',
  'NAME': 'GRASHI PATEL',
  'LOCATION': 'Mumbai',
  'DEPT': 'technology',
  'AGE': 38},
 77: {'ID': 'L027',
  'NAME': 'SHARDUL PATKI',
  'LOCATION': 'Mumbai',
  'DEPT': 'marketing',
  'AGE': 37},
 78: {'ID': 'L029',
  'NAME': 'MAYUR PAWAR',
  'LOCATION': 'Indore',
  'DEPT': 'sales',
  'AGE': 49},
 79: {'ID': 'L030',
  'NAME': 'PRIYANSH PRADHAN',
  'LOCATION': 'Pune',
  'DEPT': 'sales',
  'AGE': 24},
 80: {'ID': 'L033',
  'NAME': 'VISHALSINH RANA',
  'LOCATION': 'Pune',
  'DEPT': 'production',
  'AGE': 35},
 81: {'ID': 'L034',
  'NAME': 'SHARMAD SAMANT',
  'LOCATION': 'Indore',
  'DEPT': 'production',
  'AGE': 33},
 82: {'ID': 'L035',
  'NAME': 'SANA SAWANT',
  'LOCATION': 'Indore',
  'DEPT': 'marketing',
  'AGE': 33},
 83: {'ID': 'L037',
  'NAME': 'RUSHIL SHARMA',
  'LOCATION': 'Nagpur',
  'DEPT': 'sales',
  'AGE': 29},
 84: {'ID': 'L038',
  'NAME': 'SHIKHA SHARMA',
  'LOCATION': 'Nagpur',
  'DEPT': 'technology',
  'AGE': 36},
 85: {'ID': 'L039',
  'NAME': 'SOHAM VASUDEO',
  'LOCATION': 'Mumbai',
  'DEPT': 'technology',
  'AGE': 36},
 86: {'ID': 'L040',
  'NAME': 'RITIKA SHETTY',
  'LOCATION': 'Mumbai',
  'DEPT': 'marketing',
  'AGE': 37},
 87: {'ID': 'L041',
  'NAME': 'RUSHABH JADHAV',
  'LOCATION': 'Pune',
  'DEPT': 'production',
  'AGE': 49},
 88: {'ID': 'L042',
  'NAME': 'SAMIKSHA SARDA',
  'LOCATION': 'Pune',
  'DEPT': 'sales',
  'AGE': 33},
 89: {'ID': 'L043',
  'NAME': 'YASH CHAUDHARI',
  'LOCATION': 'Indore',
  'DEPT': 'sales',
  'AGE': 24}}

In [85]:

for i in range(len(marter_dict)):
    print("ID",marter_dict[i]["ID"],"name",marter_dict[i]["NAME"],"location",marter_dict[i]["LOCATION"],"DEPT",marter_dict[i]["DEPT"],"AGE",marter_dict[i]["AGE"])

ID A001 name HARTEJ SINGH ASSI location Mumbai DEPT sales AGE 23
ID A002 name BHAVESH BALDANIYA location Delhi DEPT technology AGE 35
ID A003 name YASH BAVISHI location Delhi DEPT production AGE 22
ID A004 name SHREEKARA BHAT location Indore DEPT sales AGE 34
ID A005 name KUNAL BHATT location Mumbai DEPT technology AGE 31
ID A006 name DARRYL CARDOZA location Mumbai DEPT production AGE 26
ID A007 name SURESH CHAUDHARY location Delhi DEPT sales AGE 28
ID A009 name CHIRAG CHOUDHARY location Pune DEPT sales AGE 40
ID A010 name YASH CHOWDHARI location Delhi DEPT technology AGE 45
ID A011 name MIHIR DHANGDHARIYA location Mumbai DEPT technology AGE 33
ID A012 name SANKET GADGE location Pune DEPT marketing AGE 33
ID A013 name ANIKET GAMI location Indore DEPT production AGE 42
ID A014 name RAHUL GIMHAVANEKAR location Delhi DEPT production AGE 27
ID A015 name ANAMICA GUPTA location Mumbai DEPT sales AGE 27
ID A016 name YOSUFF HUSSAIN location Pune DEPT sales AGE 29
ID A017 name AGHA AYAAN HYDER location Pune DEPT production AGE 22
ID A018 name ISHWAR IYER location Delhi DEPT production AGE 29
ID A019 name ATHARVA KADAM location Indore DEPT marketing AGE 28
ID A020 name RIYA KADAM location Mumbai DEPT marketing AGE 34
ID A021 name KARAN KAMAT location Pune DEPT technology AGE 44
ID A022 name RAHAT JAHA KHAN location Mumbai DEPT sales AGE 47
ID A024 name HARIKRISHNAN KONGIPARAMBIL location Nagpur DEPT sales AGE 41
ID A025 name HARSH KOTHARE location Mumbai DEPT production AGE 36
ID A026 name NIDHI MADNANI location Hydrabad DEPT technology AGE 38
ID A027 name NETRA MAHADIK location Mumbai DEPT technology AGE 38
ID A028 name KUNAL MAHAJAN location Indore DEPT sales AGE 38
ID A030 name AZRIEL MENDES location Pune DEPT production AGE 48
ID A031 name ADITYA MENON location Hydrabad DEPT production AGE 43
ID A032 name ISHANT MISHRA location Indore DEPT marketing AGE 24
ID A033 name PARAG MORE location Mumbai DEPT production AGE 24
ID A034 name ARCHIT MUNI location Hydrabad DEPT technology AGE 26
ID A035 name MOHAMMAD NEDARIYA location Mumbai DEPT marketing AGE 29
ID A036 name SUYASH NIGAM location Indore DEPT marketing AGE 29
ID A037 name AMEY NIMBALKAR location Pune DEPT marketing AGE 35
ID A038 name DHRUMIL OZA location Delhi DEPT technology AGE 36
ID A039 name HEMISH PADHIYAR location Delhi DEPT sales AGE 38
ID A040 name KRISHNA PALAN location Hydrabad DEPT sales AGE 38
ID A042 name PARTH SURVE location Delhi DEPT technology AGE 40
ID A043 name YASHUVARDHAN PATEL location Pune DEPT sales AGE 40
ID A044 name PRASHANT POOJARY location Mumbai DEPT production AGE 35
ID A045 name MUDIT POTDAR location Nagpur DEPT technology AGE 37
ID A046 name PRASAD SANGALE location Indore DEPT sales AGE 32
ID A047 name PAYAL SANKHLA location Delhi DEPT marketing AGE 31
ID A048 name MIHIR SAWANT location Nagpur DEPT marketing AGE 30
ID A049 name JAINIL SHAH location Delhi DEPT technology AGE 30
ID A050 name NEHA SHAH location Nagpur DEPT production AGE 29
ID A052 name AFRAZ SHAIKH location Indore DEPT sales AGE 27
ID A053 name HUSSAIN SHAIKH location Nagpur DEPT sales AGE 23
ID A054 name ABHISHEK SHARMA location Delhi DEPT marketing AGE 29
ID A055 name CHAYAN SHARMA location Pune DEPT technology AGE 36
ID A056 name DIVYANG SHETH location Mumbai DEPT marketing AGE 36
ID A057 name MADHURAM SHUKLA location Nagpur DEPT marketing AGE 37
ID A058 name ANMOL SINHA location Delhi DEPT production AGE 49
ID A059 name TUSHAR SINHA location Indore DEPT technology AGE 33
ID A061 name KRITI THAKRAR location Mumbai DEPT production AGE 24
ID A062 name HARSHIT THAPAR location Nagpur DEPT marketing AGE 35
ID A063 name ABHAY TIWARI location Mumbai DEPT sales AGE 33
ID A064 name TULSI VAIDYA location Pune DEPT marketing AGE 33
ID A065 name SHUBHAM WANI location Indore DEPT technology AGE 38
ID A066 name SHAYAN ZAIDI location Mumbai DEPT technology AGE 37
ID A067 name NIDHI AGRAWAL location Mumbai DEPT marketing AGE 49
ID L002 name OM AGRAWAL location Nagpur DEPT production AGE 30
ID L003 name VANSHAJ AJMERA location Nagpur DEPT marketing AGE 30
ID L005 name RAHUL BHATT location Mumbai DEPT marketing AGE 29
ID L007 name DHRUV CHAUHAN location Mumbai DEPT sales AGE 27
ID L008 name ISHA GHATULE location Pune DEPT sales AGE 23
ID L011 name ADITYA JAIN location Pune DEPT production AGE 29
ID L013 name VEDIKA KHANDELWAL location Mumbai DEPT technology AGE 36
ID L014 name ADITYA LAD location Nagpur DEPT marketing AGE 36
ID L016 name ANAY MAHESHWARI location Indore DEPT sales AGE 37
ID L017 name SANJANA MEHTA location Indore DEPT technology AGE 49
ID L019 name RHEA NAIR location Pune DEPT technology AGE 33
ID L020 name KAVIT NAVADIA location Mumbai DEPT marketing AGE 24
ID L021 name ABHAY PAI location Indore DEPT marketing AGE 35
ID L022 name SHUBH PATEL location Pune DEPT sales AGE 33
ID L023 name CHAITANYA PATEL location Mumbai DEPT production AGE 33
ID L024 name GRASHI PATEL location Mumbai DEPT technology AGE 38
ID L027 name SHARDUL PATKI location Mumbai DEPT marketing AGE 37
ID L029 name MAYUR PAWAR location Indore DEPT sales AGE 49
ID L030 name PRIYANSH PRADHAN location Pune DEPT sales AGE 24
ID L033 name VISHALSINH RANA location Pune DEPT production AGE 35
ID L034 name SHARMAD SAMANT location Indore DEPT production AGE 33
ID L035 name SANA SAWANT location Indore DEPT marketing AGE 33
ID L037 name RUSHIL SHARMA location Nagpur DEPT sales AGE 29
ID L038 name SHIKHA SHARMA location Nagpur DEPT technology AGE 36
ID L039 name SOHAM VASUDEO location Mumbai DEPT technology AGE 36
ID L040 name RITIKA SHETTY location Mumbai DEPT marketing AGE 37
ID L041 name RUSHABH JADHAV location Pune DEPT production AGE 49
ID L042 name SAMIKSHA SARDA location Pune DEPT sales AGE 33
ID L043 name YASH CHAUDHARI location Indore DEPT sales AGE 24

task 2

In [86]:
cri_set = set(df_cric["ID"])
hoc_set = set(df_hoc["ID"])
voll_set = set(df_voll["ID"])

In [87]:
common_id = voll_set.intersection(hoc_set,cri_set)

In [88]:
common_id

{'A005',
 'A013',
 'A018',
 'A026',
 'A042',
 'A045',
 'A048',
 'A053',
 'A057',
 'A062',
 'A063',
 'L011',
 'L040',
 'L043'}

In [89]:
common_id = list(common_id)

In [90]:
for i in range (len(common_id)):
    print(master_df.loc[master_df["ID"] == common_id[i]])

      ID         NAME LOCATION        DEPT  AGE
66  L011  ADITYA JAIN     Pune  production   29
      ID             NAME LOCATION       DEPT  AGE
51  A057  MADHURAM SHUKLA   Nagpur  marketing   37
      ID          NAME LOCATION   DEPT  AGE
56  A063  ABHAY TIWARI   Mumbai  sales   33
      ID          NAME LOCATION       DEPT  AGE
43  A048  MIHIR SAWANT   Nagpur  marketing   30
      ID            NAME LOCATION       DEPT  AGE
55  A062  HARSHIT THAPAR   Nagpur  marketing   35
     ID         NAME LOCATION        DEPT  AGE
4  A005  KUNAL BHATT   Mumbai  technology   31
      ID           NAME LOCATION       DEPT  AGE
86  L040  RITIKA SHETTY   Mumbai  marketing   37
      ID         NAME LOCATION        DEPT  AGE
16  A018  ISHWAR IYER    Delhi  production   29
      ID            NAME LOCATION   DEPT  AGE
47  A053  HUSSAIN SHAIKH   Nagpur  sales   23
      ID           NAME  LOCATION        DEPT  AGE
23  A026  NIDHI MADNANI  Hydrabad  technology   38
      ID         NAME LOCATION        DEPT  AGE
11  A013  ANIKET GAMI   Indore  production   42
      ID          NAME LOCATION        DEPT  AGE
40  A045  MUDIT POTDAR   Nagpur  technology   37
      ID         NAME LOCATION        DEPT  AGE
37  A042  PARTH SURVE    Delhi  technology   40
      ID            NAME LOCATION   DEPT  AGE
89  L043  YASH CHAUDHARI   Indore  sales   24

task 3

In [91]:
differtent_id = voll_set.difference(hoc_set,cri_set)

In [92]:
differtent_id

{'A024', 'A028', 'A054', 'A067'}

In [93]:
differtent_id = list(differtent_id)

In [94]:
for i in range (len(differtent_id)):
    print(master_df.loc[master_df["ID"] == differtent_id[i],["NAME","ID"]])

               NAME    ID
48  ABHISHEK SHARMA  A054
             NAME    ID
60  NIDHI AGRAWAL  A067
             NAME    ID
25  KUNAL MAHAJAN  A028
                          NAME    ID
21  HARIKRISHNAN KONGIPARAMBIL  A024

task 4

In [95]:

no_dep = df_voll["DEPT"].value_counts()
no_dep

DEPT
sales         15
technology    13
marketing     10
production     9
Name: count, dtype: int64

In [96]:
unique_count = df_voll["DEPT"].value_counts()+df_hoc["DEPT"].value_counts()+df_cric["DEPT"].value_counts()
unique_count

DEPT
marketing     37
production    32
sales         47
technology    40
Name: count, dtype: int64

In [97]:
abc = max(unique_count)
abc

47

task 5

In [98]:
cri_set = set(df_cric["ID"])
hoc_set = set(df_hoc["ID"])
voll_set = set(df_voll["ID"])

common_id = voll_set.intersection(hoc_set,cri_set)


common_id = list(common_id)


for i in range (len(common_id)):
    print(master_df.loc[master_df["ID"] == common_id[i]])
    
common_df = master_df[master_df["ID"].isin(common_id)]

min_age = common_df["AGE"].min()
max_age = common_df["AGE"].max()


print("minimum age is ",min_age)
print("max age is",max_age)

      ID         NAME LOCATION        DEPT  AGE
66  L011  ADITYA JAIN     Pune  production   29
      ID             NAME LOCATION       DEPT  AGE
51  A057  MADHURAM SHUKLA   Nagpur  marketing   37
      ID          NAME LOCATION   DEPT  AGE
56  A063  ABHAY TIWARI   Mumbai  sales   33
      ID          NAME LOCATION       DEPT  AGE
43  A048  MIHIR SAWANT   Nagpur  marketing   30
      ID            NAME LOCATION       DEPT  AGE
55  A062  HARSHIT THAPAR   Nagpur  marketing   35
     ID         NAME LOCATION        DEPT  AGE
4  A005  KUNAL BHATT   Mumbai  technology   31
      ID           NAME LOCATION       DEPT  AGE
86  L040  RITIKA SHETTY   Mumbai  marketing   37
      ID         NAME LOCATION        DEPT  AGE
16  A018  ISHWAR IYER    Delhi  production   29
      ID            NAME LOCATION   DEPT  AGE
47  A053  HUSSAIN SHAIKH   Nagpur  sales   23
      ID           NAME  LOCATION        DEPT  AGE
23  A026  NIDHI MADNANI  Hydrabad  technology   38
      ID         NAME LOCATION        DEPT  AGE
11  A013  ANIKET GAMI   Indore  production   42
      ID          NAME LOCATION        DEPT  AGE
40  A045  MUDIT POTDAR   Nagpur  technology   37
      ID         NAME LOCATION        DEPT  AGE
37  A042  PARTH SURVE    Delhi  technology   40
      ID            NAME LOCATION   DEPT  AGE
89  L043  YASH CHAUDHARI   Indore  sales   24
minimum age is  23
max age is 42

task 6

In [99]:

max_partcipation_master = master_df["LOCATION"].max()
max_partcipation

'Pune'

In [100]:
max__partcipation_cric = df_cric["LOCATION"].max()
max__partcipation_cric

'Pune'

In [101]:
max__partcipation_voll = df_voll["LOCATION"].max()
max__partcipation_voll

'Pune'

In [102]:
max__partcipation_hoc = df_hoc["LOCATION"].max()
max__partcipation_hoc

'Pune'

task 7

In [103]:
cri_set = set(df_cric["ID"])
hoc_set = set(df_hoc["ID"])
voll_set = set(df_voll["ID"])

common_id = voll_set.intersection(hoc_set,cri_set)


common_id = list(common_id)



mumbai_df = common_df[common_df["LOCATION"] == "Mumbai"]

for i in range(len(mumbai_df)):
    print(mumbai_df.iloc[i])
    print()

ID                 A005
NAME        KUNAL BHATT
LOCATION         Mumbai
DEPT         technology
AGE                  31
Name: 4, dtype: object

ID                  A063
NAME        ABHAY TIWARI
LOCATION          Mumbai
DEPT               sales
AGE                   33
Name: 56, dtype: object

ID                   L040
NAME        RITIKA SHETTY
LOCATION           Mumbai
DEPT            marketing
AGE                    37
Name: 86, dtype: object

task 8 (master data)

In [104]:
cri_set = set(df_cric["ID"])
mater_set = set(master_df["ID"])

common_id = mater_set.intersection(cri_set)


common_id = list(common_id)


Cricket_playing = common_df[common_df["LOCATION"] == "PUNE"]
Cricket_playing

Empty DataFrame
Columns: [ID, NAME, LOCATION, DEPT, AGE]
Index: []

task 8 (only cricket df)

In [105]:
pune_cric_df = df_cric[df_cric["LOCATION"] == "Pune"]

pune_cric_df = pune_cric_df[["NAME", "AGE"]]
print(pune_cric_df)

                NAME  AGE
4   CHIRAG CHOUDHARY   40
6       SANKET GADGE   33
9     YOSUFF HUSSAIN   29
10  AGHA AYAAN HYDER   22
13       KARAN KAMAT   44
15     AZRIEL MENDES   48
21    AMEY NIMBALKAR   35
37      TULSI VAIDYA   33
41      ISHA GHATULE   23
42       ADITYA JAIN   29
45         RHEA NAIR   33
47       SHUBH PATEL   33
56    RUSHABH JADHAV   49
57    SAMIKSHA SARDA   33